In [1]:
import pandas as pd
import os

### В папке subsid (shared/homeworks/python_ds_miniprojects/5_subsid) находятся файлы (tm_sales_1, tm_sales_2, ...) с продажами продуктов через телемаркетинг. Каждый файл содержит, как минимум, 4 колонки (поля): FILIAL_ID, SUBS_ID, PROD_ID, ACT_DTTM.

Суть задачи в том, чтобы проверить подключения продуктов определенным пользователям, соединив файлы о продажах с логами по подключениям в системе.

In [2]:
path = '/mnt/HC_Volume_18315164/home-jupyter/jupyter-d-dontsov/shared/homeworks/python_ds_miniprojects/5_subsid/subsid'
os.listdir(path)

['prod_activations_logs.csv',
 'tm_sales_1.csv',
 'tm_sales_2.csv',
 'tm_sales_3.csv']

In [3]:
for i in range(len(os.listdir(path))):
    if i == 0:
        prod_activations_logs = pd.read_csv(path + '/prod_activations_logs.csv', sep=";")
    elif i == 1:
        tm_sales_1 = pd.read_csv(path + '/tm_sales_1.csv', sep=";")
    elif i == 2:
        tm_sales_2 = pd.read_csv(path + '/tm_sales_2.csv', sep=";")
    elif i == 3:
        tm_sales_3 = pd.read_csv(path + '/tm_sales_3.csv', sep=";")

In [68]:
prod_activations_logs

     SUBS_ID  PROD_ID        START_DTTM          END_DTTM
1  id4651830     1954  20-03-2020 14:59  01-12-2020 00:00
5  id7646509     6431  19-03-2020 13:00  19-03-2020 13:03
2  id7461794     3310  20-03-2020 17:25  01-12-2020 00:00
3  id5416547     1743  17-03-2020 10:17  25-03-2020 11:00
4  id8238421     1859  01-03-2020 11:42  01-03-2020 11:43
3  id8641743     2752  20-03-2020 15:44  21-04-2020 15:44
2  id2185490     3210  16-03-2020 16:28  01-12-2020 00:00
6  id7642700     3020  15-03-2020 14:21  15-03-2020 23:42
2  id8741631     5677  19-03-2020 12:28  01-12-2020 00:00

In [4]:
tm_sales_1

     SUBS_ID  FILIAL_ID  PROD_ID          ACT_DTTM
0  id4651830          1     1954  20-03-2020 14:59
1    7646509          5     6431  19-03-2020 13:00
2  id7412683          4     3313  22-03-2020 17:25

In [5]:
tm_sales_2

   FILIAL_ID    SUBS_ID  PROD_ID          ACT_DTTM
0          3  id5416547     1743  17-03-2020 10:17
1          4        NaN     7421  12-03-2020 11:25
2          7    8362218     9879  05-03-2020 11:42
3          2    2185490     3210  16-03-2020 16:28

In [6]:
tm_sales_3

   FILIAL_ID  PROD_ID    SUBS_ID          ACT_DTTM
0          3     1499  id5764122  18-03-2020 15:44
1          6     3020  id7642700  15-03-2020 14:21
2          2     5677  id1374509  17-03-2020 11:48

Особенности данных:

- сотрудники телемаркетинга не всегда указывают полный id, если 'id' нет в начале SUBS_ID, то нужно его добавить
- поля в файлах могут быть расположены абсолютно случайным образом, но названия полей статичны
- продажа не засчитывается, если отключение (END_DTTM) произошло меньше чем через 5 минут после подключения (START_DTTM)
- если в файле с продажами встречается строка без указанного SUBS_ID, она пропускается

Сохраните результат в датафрэйм с разделителем ;, содержащий корректные подключения.

In [7]:
tm_sales_1 = tm_sales_1.reindex(columns=['FILIAL_ID', 'SUBS_ID', 'PROD_ID', 'ACT_DTTM'])
tm_sales_3 = tm_sales_3.reindex(columns=['FILIAL_ID', 'SUBS_ID', 'PROD_ID', 'ACT_DTTM'])

In [8]:
tm_sales_1

   FILIAL_ID    SUBS_ID  PROD_ID          ACT_DTTM
0          1  id4651830     1954  20-03-2020 14:59
1          5    7646509     6431  19-03-2020 13:00
2          4  id7412683     3313  22-03-2020 17:25

In [9]:
all_tabels = pd.concat([tm_sales_1, tm_sales_2, tm_sales_3])

In [10]:
all_tabels

   FILIAL_ID    SUBS_ID  PROD_ID          ACT_DTTM
0          1  id4651830     1954  20-03-2020 14:59
1          5    7646509     6431  19-03-2020 13:00
2          4  id7412683     3313  22-03-2020 17:25
0          3  id5416547     1743  17-03-2020 10:17
1          4        NaN     7421  12-03-2020 11:25
2          7    8362218     9879  05-03-2020 11:42
3          2    2185490     3210  16-03-2020 16:28
0          3  id5764122     1499  18-03-2020 15:44
1          6  id7642700     3020  15-03-2020 14:21
2          2  id1374509     5677  17-03-2020 11:48

In [11]:
all_tabels = all_tabels.dropna()

In [12]:
all_tabels.SUBS_ID = all_tabels.SUBS_ID.apply(lambda x: 'id' + x if x.startswith('id') == False else x)

/opt/tljh/user/lib/python3.7/site-packages/pandas/core/generic.py:5165: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [13]:
all_tabels

   FILIAL_ID    SUBS_ID  PROD_ID          ACT_DTTM
0          1  id4651830     1954  20-03-2020 14:59
1          5  id7646509     6431  19-03-2020 13:00
2          4  id7412683     3313  22-03-2020 17:25
0          3  id5416547     1743  17-03-2020 10:17
2          7  id8362218     9879  05-03-2020 11:42
3          2  id2185490     3210  16-03-2020 16:28
0          3  id5764122     1499  18-03-2020 15:44
1          6  id7642700     3020  15-03-2020 14:21
2          2  id1374509     5677  17-03-2020 11:48

In [14]:
prod_activations_logs

     SUBS_ID  PROD_ID        START_DTTM          END_DTTM
1  id4651830     1954  20-03-2020 14:59  01-12-2020 00:00
5  id7646509     6431  19-03-2020 13:00  19-03-2020 13:03
2  id7461794     3310  20-03-2020 17:25  01-12-2020 00:00
3  id5416547     1743  17-03-2020 10:17  25-03-2020 11:00
4  id8238421     1859  01-03-2020 11:42  01-03-2020 11:43
3  id8641743     2752  20-03-2020 15:44  21-04-2020 15:44
2  id2185490     3210  16-03-2020 16:28  01-12-2020 00:00
6  id7642700     3020  15-03-2020 14:21  15-03-2020 23:42
2  id8741631     5677  19-03-2020 12:28  01-12-2020 00:00

In [33]:
prefinal_table = prod_activations_logs.merge(all_tabels, on=['SUBS_ID', 'PROD_ID'])

In [34]:
prefinal_table

,SUBS_ID,PROD_ID,START_DTTM,END_DTTM,FILIAL_ID,ACT_DTTM
0,id4651830,1954,20-03-2020 14:59,01-12-2020 00:00,1,20-03-2020 14:59
1,id7646509,6431,19-03-2020 13:00,19-03-2020 13:03,5,19-03-2020 13:00
2,id5416547,1743,17-03-2020 10:17,25-03-2020 11:00,3,17-03-2020 10:17
3,id2185490,3210,16-03-2020 16:28,01-12-2020 00:00,2,16-03-2020 16:28
4,id7642700,3020,15-03-2020 14:21,15-03-2020 23:42,6,15-03-2020 14:21

In [35]:
prefinal_table

,SUBS_ID,PROD_ID,START_DTTM,END_DTTM,FILIAL_ID,ACT_DTTM
0,id4651830,1954,20-03-2020 14:59,01-12-2020 00:00,1,20-03-2020 14:59
1,id7646509,6431,19-03-2020 13:00,19-03-2020 13:03,5,19-03-2020 13:00
2,id5416547,1743,17-03-2020 10:17,25-03-2020 11:00,3,17-03-2020 10:17
3,id2185490,3210,16-03-2020 16:28,01-12-2020 00:00,2,16-03-2020 16:28
4,id7642700,3020,15-03-2020 14:21,15-03-2020 23:42,6,15-03-2020 14:21

In [36]:
prefinal_table.dtypes

SUBS_ID       object
PROD_ID        int64
START_DTTM    object
END_DTTM      object
FILIAL_ID      int64
ACT_DTTM      object
dtype: object

In [39]:
prefinal_table.START_DTTM = pd.to_datetime(prefinal_table.START_DTTM, format="%d-%m-%Y %H:%M")

In [40]:
prefinal_table.END_DTTM = pd.to_datetime(prefinal_table.END_DTTM, format="%d-%m-%Y %H:%M")

In [41]:
prefinal_table

,SUBS_ID,PROD_ID,START_DTTM,END_DTTM,FILIAL_ID,ACT_DTTM
0,id4651830,1954,2020-03-20 14:59:00,2020-12-01 00:00:00,1,20-03-2020 14:59
1,id7646509,6431,2020-03-19 13:00:00,2020-03-19 13:03:00,5,19-03-2020 13:00
2,id5416547,1743,2020-03-17 10:17:00,2020-03-25 11:00:00,3,17-03-2020 10:17
3,id2185490,3210,2020-03-16 16:28:00,2020-12-01 00:00:00,2,16-03-2020 16:28
4,id7642700,3020,2020-03-15 14:21:00,2020-03-15 23:42:00,6,15-03-2020 14:21

In [ ]:
'''
ACT_DTTM;FILIAL_ID;difference
20-03-2020 14:59;1;255 days 09:01:00 - пример выходного файла, поэтому нужно вопольховаться format при парсинге времени
'''

In [42]:
prefinal_table['delta'] = prefinal_table.END_DTTM - prefinal_table.START_DTTM

In [43]:
prefinal_table

,SUBS_ID,PROD_ID,START_DTTM,END_DTTM,FILIAL_ID,ACT_DTTM,delta
0,id4651830,1954,2020-03-20 14:59:00,2020-12-01 00:00:00,1,20-03-2020 14:59,255 days 09:01:00
1,id7646509,6431,2020-03-19 13:00:00,2020-03-19 13:03:00,5,19-03-2020 13:00,0 days 00:03:00
2,id5416547,1743,2020-03-17 10:17:00,2020-03-25 11:00:00,3,17-03-2020 10:17,8 days 00:43:00
3,id2185490,3210,2020-03-16 16:28:00,2020-12-01 00:00:00,2,16-03-2020 16:28,259 days 07:32:00
4,id7642700,3020,2020-03-15 14:21:00,2020-03-15 23:42:00,6,15-03-2020 14:21,0 days 09:21:00

In [44]:
prefinal_table.query('delta > "00:05:00"')

,SUBS_ID,PROD_ID,START_DTTM,END_DTTM,FILIAL_ID,ACT_DTTM,delta
0,id4651830,1954,2020-03-20 14:59:00,2020-12-01 00:00:00,1,20-03-2020 14:59,255 days 09:01:00
2,id5416547,1743,2020-03-17 10:17:00,2020-03-25 11:00:00,3,17-03-2020 10:17,8 days 00:43:00
3,id2185490,3210,2020-03-16 16:28:00,2020-12-01 00:00:00,2,16-03-2020 16:28,259 days 07:32:00
4,id7642700,3020,2020-03-15 14:21:00,2020-03-15 23:42:00,6,15-03-2020 14:21,0 days 09:21:00

In [51]:
lst = prefinal_table.query('delta > "00:05:00"').drop_duplicates().SUBS_ID.sort_values().to_list()

In [52]:
print(*lst, sep=", ")

id2185490, id4651830, id5416547, id7642700

In [ ]:
# сохраняем файл, как просят
# ACT_DTTM;             FILIAL_ID;             difference
# 20-03-2020 14:59;          1;           255 days 09:01:00

In [55]:
final_table = prefinal_table[['ACT_DTTM', 'FILIAL_ID', 'delta']] \
.rename(columns={'delta': 'difference'}) \
.drop_duplicates() \
.query('difference > "5m"')
final_table

           ACT_DTTM  FILIAL_ID        difference
0  20-03-2020 14:59          1 255 days 09:01:00
2  17-03-2020 10:17          3   8 days 00:43:00
3  16-03-2020 16:28          2 259 days 07:32:00
4  15-03-2020 14:21          6   0 days 09:21:00

In [57]:
df = final_table.to_csv('df.csv', sep=';', index=False)

# Решение от авторов (где с моим не сходится)

## 1. можно сделать игнорирование индекса при соединении столбцов:

In [ ]:
all_tabels = pd.concat([tm_sales_1, tm_sales_2, tm_sales_3], inore_index=True)

## 2. Можно отобрать строки, НЕ начинающиеся с id при помощи loc

In [ ]:
all_tabels.loc[~all_tabels.SUBS_ID.str.startswith('id')] # тильда - отрицание, вернет датафрейм

In [ ]:
'''
метод работать не будет, т.к. есть нулевые строки Nan.
В таком случае аксессор str к ним применять нельзя, можно только после удаления Nan
'''

## 3. Дропать NaN надо по конкретной колонке, а не по всей таблице

In [ ]:
all_tabels.dropna(subset=['SUBS_ID'])

In [ ]:
# после этого можно применять loc

## 4. Добавляем id к строкам, где его нет

In [ ]:
# укажем в loc второй параметр - он вернет уже серию (см.пункт 2)
# прибавляем id к строкам, где нет id
all_tabels.loc[~all_tabels.SUBS_ID.str.startswith('id'), ['SUBS_ID']] = \ = \
'id' + all_tabels.loc[~all_tabels.SUBS_ID.str.startswith('id'), ['SUBS_ID']] = \

## 5. Фильтрация данных более 5 минут

In [ ]:
result = prod_activations_logs.loc[prod_activations_logs.difference > pd.Timedelta(5, 'm')]